package com.multi.maven.enums;

/**
 * 定义处理码
 * </p>
 * 规则： 处理成功 SUCCESS除外，模块简称+4位序号
 * </p>
 * 模块简称： 通用的 GEN 系统 SYS 、公共 CMN 、 用户 USR 、 瘦身 THI 、搜索 SCH 、第三方 EXT
 * 融云 RGC、后台管理 MNG、互动 INA、减约知道KNW 动态 DYN 社区CMU HTM h5页面 消息 NTC
 * 交易 TRA SDK管理 SDK
 * </p>
 *
 * @author yangsongbo
 */
public enum RetCodeEnum implements PersistentEnum<String> {

    SUCCESS("处理成功", ""),
    BIZWARN("业务警告", ""),
    LOGOUT("强制登出", ""),
    UPDATE("强制更新", ""),

    /**
     * 系统错误
     */
    SYS0001("系统错误", "系统错误"),
    /**
     * 重复请求
     */
    SYS0002("重复请求", "重复请求"),
    /**
     * 访问频繁
     */
    SYS0003("访问频繁", "访问频繁"),
    /**
     * 请求中的密钥不合法
     */
    SYS0004("请求中的密钥不合法", "请求中的密钥不合法"),
    /**
     * 请求中的密钥不存在
     */
    SYS0005("请求中的密钥不存在", "请求中的密钥不存在"),
    /**
     * 请求中的用户ID不存在
     */
    SYS0007("请求中的用户ID不存在", "请求中的用户ID不存在"),
    /**
     * 请求唯一ID不能为空
     */
    SYS0011("请求唯一ID不能为空", "请求唯一ID不能为空"),
    /**
     * 登录类型不能为空
     */
    SYS0012("登录类型不能为空", "登录类型不能为空"),
    /**
     * 登录类型参数不合法
     */
    SYS0013("登录类型参数不合法", "登录类型参数不合法"),
    /**
     * 下载渠道不能为空
     */
    SYS0014("下载渠道不能为空", "下载渠道不能为空"),
    /**
     * 系统内版本号不能为空
     */
    SYS0015("系统内版本号不能为空", "系统内版本号不能为空"),
    /**
     * 设备唯一标识ID不能为空
     */
    SYS0016("设备唯一标识ID不能为空", "设备唯一标识ID不能为空"),
    /**
     * 手机机型不能为空
     */
    SYS0017("手机机型不能为空", "手机机型不能为空"),
    /**
     * 手机品牌不能为空
     */
    SYS0018("手机品牌不能为空", "手机品牌不能为空"),
    /**
     * 当前网络不能为空
     */
    SYS0019("当前网络不能为空", "当前网络不能为空"),
    /**
     * 当前网络参数不合法
     */
    SYS0020("当前网络参数不合法", "当前网络参数不合法"),
    /**
     * 个推id不能为空
     */
    SYS0021("个推id不能为空", "个推id不能为空"),
    /**
     * 检验标识不能为空
     */
    SYS0022("检验标识不能为空", "检验标识不能为空"),
    /**
     * 退出登录错误
     */
    SYS0023("退出登录错误", "退出登录错误"),
    /**
     * 请求接口不存在
     */
    SYS0024("请求接口不存在", "请求接口不存在"),
    /**
     * 用户信息不全
     */
    SYS0025("用户信息不全", "用户信息不全"),
    /**
     * 当前版本不支持该请求,请更新版本
     */
    SYS0026("当前版本不支持该请求,请更新版本", "当前版本不支持该请求,请更新版本"),
    /**
     * 权限校验失败
     */
    SYS0027("权限校验失败", "权限校验失败"),
    /**
     * session已失效
     */
    SYS0028("session已失效", "session已失效"),
    /**
     * 接口调用环境校验失败
     */
    SYS0029("接口调用环境校验失败", "接口调用环境校验失败"),
    /**
     * 应用ID不能为空
     **/
    SYS0030("应用ID不能为空", "应用ID不能为空"),


    /**
     * 页号不合法
     */
    GEN0001("页号不合法", "页号不合法"),
    /**
     * 每页条数不合法
     */
    GEN0002("每页条数不合法", "每页条数不合法"),
    /**
     * 分页方向不能为空
     */
    GEN0003("分页方向不能为空", "分页方向不能为空"),
    /**
     * 分页对象不能为空
     */
    GEN0004("分页对象不能为空", "分页对象不能为空"),
    /**
     * 未达到发送间隔时间，请稍后再试
     */
    GEN0005("未达到发送间隔时间，请稍后再试", "未达到发送间隔时间，请稍后再试"),

    /**
     * 微信code不能为空
     */
    CMN0001("微信code不能为空", "微信code不能为空"),
    /**
     * 微信授权失败
     */
    CMN0002("微信授权失败", "微信授权失败"),
    /**
     * 参数url不能为空
     */
    CMN0003("参数url不能为空", "参数url不能为空"),


 
    /**
     * 长度必须为11
     **/
    USR0002("手机号长度必须为11", "手机号长度必须为11"),
    /**
     * 密码不能为空
     **/
    USR0003("密码不能为空", "密码不能为空"),
   
    /**
     * 验证码校验失败
     **/
    USR0005("验证码校验失败", "验证码校验失败"),
    
    /**
     * 保存验证码失败
     **/
    USR0007("保存验证码失败", "保存验证码失败"),
  
    /**
     * 重复手机号
     **/
    USR0009("重复手机号", "重复手机号"),
    /**
     * 两次密码不一致
     **/
    USR0010("两次密码不一致", "两次密码不一致"),
    /**
     * 密码错误
     **/
    USR0011("密码错误", "密码错误"),
    
    /**
     * 邮箱地址不能为空
     **/
    USR0012("邮箱地址不能为空", "邮箱地址不能为空"),
    
    /**
     * 用户已注册
     **/
    USR0031("USR0031", "该用户已被注册"),
    /**
     * 验证码类型不合法
     **/
    USR0032("USR0032", "验证码类型不合法"),

    /**
     * 开发者ID不能为空
     */
    USR0034("USR0034", "开发者ID不能为空"),
    /**
     * 用户未提交开发者审核
     */
    USR0035("USR0035", "用户未提交认证"),
    /**
     * 用户认证审核未通过
     **/
    USR0036("USR0036", "用户认证审核未通过"),

    /**
     * 开发者申请认证
     **/
    DEV0001("开发者类型不能为空", "开发者类型不能为空"),
    DEV0002("企业名称不能为空", "企业名称不能为空"),
    DEV0003("联系人名称不能为空", "联系人名称不能为空"),
    DEV0004("邮箱地址不能为空", "邮箱地址不能为空"),
    DEV0005("开发者类型不合法", "开发者类型不合法"),
    DEV0006("邮箱验证码不能为空", "邮箱验证码不能为空"),
    DEV0007("证件号不能为空", "证件号不能为空"),
    DEV0008("证件照片未上传", "证件照片未上传"),
    DEV0009("场景描述不能为空", "场景描述不能为空"),
    DEV0010("手机号不能为空", "手机号不能为空"),
    DEV0011("证件照片数量不符", "证件照片数量不符"),
    DEV0012("验证码不能为空", "验证码不能为空"),
    DEV0013("密码不能为空", "密码不能为空"),
    DEV0014("开发者ID不能为空", "开发者ID不能为空"),
    DEV0015("用户已被禁用,请联系平台", "用户已被禁用,请联系平台"),
    DEV0016("该账号已申请认证,请登录查看", "该账号已申请认证,请登录查看"),
    DEV0017("该手机号已注册", "该手机号已注册"),
    DEV0019("该手机号未注册", "该手机号未注册"),
    DEV0020("密码错误，请重新输入", "密码错误，请重新输入"),
    DEV0021("原始密码不能为空", "原始密码不能为空"),
    DEV0022("密码错误", "密码错误"),
    DEV0023("原手机号不能为空", "原手机号不能为空"),
    DEV0024("原手机号验证码不能为空", "原手机号验证码不能为空"),
    DEV0025("新手机号不能为空", "新手机号不能为空"),
    DEV0026("新手机号验证码不能为空", "新手机号验证码不能为空"),
   
    DEV0029("开发者信息不存在", "开发者信息不存在"),
    DEV0030("修改对象不能为空", "修改对象不能为空"),
    DEV0031("开发者未认证", "开发者未认证"),


    /**
     * 消息类型不能为空
     **/
    MSG0001("消息类型不能为空", "消息类型不能为空"),
    
    /**
     * 消息类型不合法
     **/
    MSG0002("消息类型不合法", "消息类型不合法"),
    
    /**
     * 手机号码不能为空
     **/
    MSG0003("手机号码不能为空", "手机号码不能为空"),
    
    /**
     * 邮箱不能为空
     **/
    MSG0004("邮箱不能为空", "邮箱不能为空"),

    /**
     * 开发者ID不能为空
     **/
    MSG0005("开发者ID不能为空", "开发者ID不能为空"),
    
    /**
     * 邮箱已经注册过，无法重复注册，请直接登录
     */
    MSG0006("邮箱已经注册过，无法重复注册，请直接登录", "邮箱已经注册过，无法重复注册，请直接登录"),

    /**
     * 发送验证码失败
     **/
    MSG0007("发送验证码失败", "发送验证码失败"),
    
    /**
     * 该手机号已注册
     **/
    MSG0008("该手机号已注册", "该手机号已注册"),
    
    /**
     * 该手机号未注册
     **/
    MSG0009("该手机号未注册", "该手机号未注册"),
    
    /**
     * 获取消息内容失败
     **/
    MSG0010("获取消息内容失败", "系统异常，请稍后再试"),
    
    /**
     * 验证码不能为空
     **/
    MSG0011("验证码不能为空", "验证码不能为空"),
    
    /**
     * 验证码校验失败
     **/
    MSG0012("验证码校验失败", "验证码校验失败"),
    MSG0013("原手机号验证码校验失败", "原手机号验证码校验失败"),
    MSG0014("新手机号验证码校验失败", "新手机号验证码校验失败"),

    /**
     * 开发者创建APP
     **/
    APP0001("应用名称不能为空", "应用名称不能为空"),
    APP0002("应用接口列表不能为空", "应用接口列表不能为空"),
    APP0003("应用平台不能为空", "应用平台不能为空"),
    APP0004("应用描述不能为空", "应用描述不能为空"),
    APP0005("应用公钥不能为空", "应用公钥不能为空"),
    APP0006("开发者ID不能为空", "开发者ID不能为空"),
    APP0007("应用信息不存在", "应用信息不存在"),
    APP0008("验证信息不能为空", "验证信息不能为空"),
    APP0009("应用ID不能为空", "应用ID不能为空"),

    /**
     * 充值
     */
    REC0001("支付宝支付异常,请重试","支付宝支付异常,请重试"),
    REC0002("订单号不存在,请重新下单支付", "订单号不存在,请重新下单支付"),
    REC0003("订单号状态异常,请刷新后重试", "订单号状态异常,请刷新后重试"),
    
    /**
     * 支付金额校验失败
     **/
    TRA0001("支付金额校验失败","支付金额校验失败"),
    /**
     * 订单不存在
     **/
	TRA0002("订单不存在","订单不存在"),
	 /**
     * 订单取消失败
     **/
	TRA0003("订单取消失败","订单取消失败"),
	 /**
     * 保存订单失败
     **/
	TRA0004("保存订单失败","保存订单失败"),
	 /**
     * 支付方式不能为空
     **/
	TRA0005("支付方式不能为空","支付方式不能为空"),
	 /**
     * 订单当前状态不允许再次支付
     **/
	TRA0006("订单当前状态不允许再次支付","订单当前状态不允许再次支付"),
	 /**
     * 支付方式不合法
     **/
	TRA0007("支付方式不合法","支付方式不合法"),
	 /**
     * 订单编号不能为空
     **/
	TRA0008("订单编号不能为空","订单编号不能为空"),

    ;


    private String value;
    private String displayName;

    public String getRetCode() {
        return this.name();
    }

    public String getRetInfo() {
        return this.value;
    }

    public String getTooltip() {
        return this.displayName;
    }

    public void setValue(String value) {
        this.value = value;
    }

    public void setDisplayName(String displayName) {
        this.displayName = displayName;
    }

    @Override
    public String getValue() {
        return value;
    }

    @Override
    public String getDisplayName() {
        return displayName;
    }

    private RetCodeEnum(String value, String displayName) {
        this.value = value;
        this.displayName = displayName;
    }

}
